import 'package:flutter/material.dart';
import 'package:kodesh_app/providers/tfilot.dart';
import 'package:kodesh_app/widgets/custom_app_bar.dart';
import 'package:flutter_gen/gen_l10n/app_localizations.dart';
import 'package:kodesh_app/widgets/tefila_widget.dart';

class AdlakatNerot extends StatelessWidget {
  AdlakatNerot({super.key});
  static String routeName = '/adlakat_nerot';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: CustomAppBar(
            title: AppLocalizations.of(context)!.candleLightingOrderMenu),
        body: TefilaWidget(
          getBracha: getBracha,
          isWithNosah: false,
          imagePath: 'assets/nerot_shabat.jpg',
          imageExtaLine:
               '* לאחר הדלקת הנרות עוצמת האשה את עיניה או מכסה אותן בידיה, מברכת ושוב מסתכלת בנרות.\n',
        ));
  }

  late final Map<String, Map<Nosah, List<String>>> getBracha = {
    'he': brachaHeb,
    'en': brachaEn,
  };

  final Map<Nosah, List<String>> brachaHeb = {
    Nosah.mizrah: const [
      'נוסח מזרח',
      'Sבָּרוּךְ',
      ' אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, ',
      'אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ ',
      'לְהַדְלִיק נֵר שֶׁל שַׁבָּת.',
      'S\nיְהִי רָצוֹן מִלְּפָנֶיךָ',
      ', יְיָ אֱלֹהַי אֱלֹהֵי יִשְׂרָאֵל, שֶׁתְּחוֹנֵן אוֹתִי וְאֶת אִישִׁי וְאֶת כֹּל קְרוֹבַי, וְתִתֶּן לָנוּ וּלְכָל יִשְׂרָאֵל חַיִּים טוֹבִים וַאֲרֻכִּים, וְתִזְכְּרֵנוּ בְּזִכְרוֹן טוֹבָה וּבְרָכָה, וְתִפְקְדֵנוּ בִּפְקֻדַּת יְשׁוּעָה וְרַחֲמִים, וְתַשְׁכֵּן שְׁכִינָתְךָ בֵּינֵינוּ, וְזַכֵּנוּ לְגַדֵּל בָּנִים וּבְנֵי בָנִים חֲכָמִים וּנְבוֹנִים אוֹהֲבֵי יְיָ, יִרְאֵי אֱלֹהִים, אַנְשֵׁי אֱמֶת זֶרַע קֹדֶשׁ, בַּיְיָ דְּבֵקִים וּמְאִירִים אֶת הָעוֹלָם בְּתּוֹרָה וּבְמַעֲשִׂים טוֹבִים וּבְכָל מְלֶאכֶת עֲבוֹדַת הַבּוֹרֵא. אָנָּא, שְׁמַע אֶת תְּחִנָּתִי בִּזְכוּת שָׂרָה וְרִבְקָה רָחֵל וְלֵאָה אִמּוֹתֵינוּ, וְהָאֵר נֵרֵנוּ שֶׁלֹּא יִכְבֶּה לְעוֹלָם וָעֶד, וְהָאֵר פָּנֶיךָ וְנִוָּשֵׁעָה. אָמֵן.'
    ],
  };

  final Map<Nosah, List<String>> brachaEn = {
    Nosah.mizrah: const [
      'Eastern version',
      'Sבָּרוּךְ',
      ' אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, ',
      'אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ ',
      'לְהַדְלִיק נֵר שֶׁל שַׁבָּת.',
      'S\nיְהִי רָצוֹן מִלְּפָנֶיךָ',
      ', יְיָ אֱלֹהַי אֱלֹהֵי יִשְׂרָאֵל, שֶׁתְּחוֹנֵן אוֹתִי וְאֶת אִישִׁי וְאֶת כֹּל קְרוֹבַי, וְתִתֶּן לָנוּ וּלְכָל יִשְׂרָאֵל חַיִּים טוֹבִים וַאֲרֻכִּים, וְתִזְכְּרֵנוּ בְּזִכְרוֹן טוֹבָה וּבְרָכָה, וְתִפְקְדֵנוּ בִּפְקֻדַּת יְשׁוּעָה וְרַחֲמִים, וְתַשְׁכֵּן שְׁכִינָתְךָ בֵּינֵינוּ, וְזַכֵּנוּ לְגַדֵּל בָּנִים וּבְנֵי בָנִים חֲכָמִים וּנְבוֹנִים אוֹהֲבֵי יְיָ, יִרְאֵי אֱלֹהִים, אַנְשֵׁי אֱמֶת זֶרַע קֹדֶשׁ, בַּיְיָ דְּבֵקִים וּמְאִירִים אֶת הָעוֹלָם בְּתּוֹרָה וּבְמַעֲשִׂים טוֹבִים וּבְכָל מְלֶאכֶת עֲבוֹדַת הַבּוֹרֵא. אָנָּא, שְׁמַע אֶת תְּחִנָּתִי בִּזְכוּת שָׂרָה וְרִבְקָה רָחֵל וְלֵאָה אִמּוֹתֵינוּ, וְהָאֵר נֵרֵנוּ שֶׁלֹּא יִכְבֶּה לְעוֹלָם וָעֶד, וְהָאֵר פָּנֶיךָ וְנִוָּשֵׁעָה. אָמֵן.'
    ],
  };
}
