import 'package:flutter/material.dart';
import 'package:kodesh_app/providers/tfilot.dart';
import 'package:kodesh_app/widgets/custom_app_bar.dart';
import 'package:flutter_gen/gen_l10n/app_localizations.dart';
import 'package:kodesh_app/widgets/tefila_widget.dart';

class Havdalah extends StatelessWidget {
  Havdalah({super.key});
  static const String routeName = '/havdalah';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: CustomAppBar(title: AppLocalizations.of(context)!.havdalah),
        body: TefilaWidget(
          getBracha: getBracha,
          imagePath: 'assets/havdalah.webp',
          // imageExtaLine:
          //     '* יש להניח את הנרות מימין לשמאל ולהדליקן משמאל לימין.\n',
        ));
  }

  late final Map<String, Map<Nosah, List<String>>> getBracha = {
    'he': brachaHeb,
    'en': brachaEn,
  };

  final Map<Nosah, List<String>> brachaHeb = {
    Nosah.ashkenaz: const [
      'נוסח אשכנז',
      'Bנוטל הכוס בידו ואומר:',
      'הִנֵּה אֵל יְשׁוּעָתִי אֶבְטַח וְלֹא אֶפְחָד. כִּי עָזִּי וְזִמְרָת יָהּ יְהֹוָה וַיְהִי לִי לִישׁוּעָה. וּשְׁאַבְתֶּם מַיִם בְּשָׂשׁוֹן מִמַּעַיְנֵי הַיְשׁוּעָה. לַיהֹוָה הַיְשׁוּעָה עַל עַמְּךָ בִרְכָתֶךָ סֶּלָה. יְהֹוָה צְבָאוֹת עִמָּנוּ מִשְׂגָּב לָנוּ אֱלֹהֵי יַעֲקֹב סֶלָה. יְהֹוָה צְבָאוֹת אַשְׁרֵי אָדָם בֹּטֵחַ בָּךְ. יְהֹוָה הוֹשִׁיעָה הַמֶּלֶךְ יַעֲנֵנוּ בְּיוֹם קָרְאֵנוּ. לַיְּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה וְשָׂשׁוֹן וִיקָר. כֵּן תִּהְיֶה לָנוּ: כּוֹס יְשׁוּעוֹת אֶשָּׂא. וּבְשֵׁם יְהֹוָה אֶקְרָא.',
      'סַבְרִי מָרָנָן וְרַבָּנָן וְרַבּוֹתַי:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא פְּרִי הַגָּפֶן.',
      'Tלוקח הבשמים בימינו ומברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא מִינֵי בְשָׂמִים.',
      'Tועל הנר מברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא מְאוֹרֵי הָאֵשׁ.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה',
      ', אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל. בֵּין אוֹר לְחשֶׁךְ. בֵּין יִשְׂרָאֵל לָעַמִּים. בֵּין יוֹם הַשְּׁבִיעִי לְשֵׁשֶׁת יְמֵי הַמַּעֲשֶׂה: בָּרוּךְ אַתָּה יְהֹוָה. הַמַבְדִּיל בֵּין קֹדֶשׁ לְחוֹל.'
    ],
    Nosah.mizrah: const [
      'נוסח מזרח',
      'רִאשׁוֹן לְצִיּוֹן הִנֵּה הִנָּם, וְלִירוּשָׁלַיִם מְבַשֵּׂר אֶתֵּן. אַל תִּשְׂמְחִי אוֹיַבְתִּי לִי כִּי נָפַלְתִּי קַמְתִּי, כִּי אֵשֵׁב בַּחוֹשֶׁךְ יְהֹוָה אוֹר לִי. לַיּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה, וְשָׂשֹׂן וִיקָר. וַיְהִי דָוִד לְכָל דְּרָכָיו מַשְׂכִּיל וַיהֹוָה עִמּוֹ. וְנֹחַ מָצָא חֵן בְּעֵינֵי יְהֹוָה כֵּן נִמְצָא חֵן וְשֵׂכֶל טוֹב בְּעֵינֵי אֱלֹהִים וְאָדָם. קוּמִי אוֹרִי כִּי בָא אוֹרֵךְ, וּכְבוֹד יְהֹוָה עָלַיִךְ זָרַח. כִּי הִנֵּה הַחֹשֶׁךְ יְכַסֶּה אֶרֶץ וַעֲרָפֶל לְאֻמִּים, וְעָלַיִךְ יִזְרַח יְהֹוָה וּכְבוֹדוֹ עָלַיִךְ יֵרָאֶה.',
      'Tויקח הכוס בידו ויאמר:',
      'Sכּוֹס ישׁוּעוֹת אֶשָּׂא, וּבְשֵׁם יְהֹוָה אֶקְרָא.',
      'אָנָּא יְהֹוָה הוֹשִׁיעָה נָּא (שתי פעמים).',
      'אָנָּא יְהֹוָה הַצְלִיחָה נָא (שתי פעמים).',
      'הַצְלִיחֵנוּ, הַצְלַח דּרָכֵינוּ, הַצְלַח לִמּוּדֵינוּ, וּשְׁלַח בְּרָכָה רְוָחָה וְהַצְלָחָה בְּכָל מַעֲשֵׂה יָדֵינוּ, כְּדִכְתִיב יִשָּׂא בְרָכָה מֵאֵת יְהֹוָה וּצְדָקָה מֵאֱלֹהֵי יִשְׁעוֹ. לַיּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה, וְשָׂשֹׂן וִיקָר. וּכְתִיב וַיְהִי דָוִד לְכָל דְּרָכָיו מַשְׂכִּיל, וַיהֹוָה עִמּוֹ. כֵּן יִהְיֶה עִמָּנוּ תָמִיד.',
      'Sסַבְרֵי מָרָנָן. (ועונים:) לחַיִּים.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגֶּפֶן.',
      'T(במוצאי יו"ט שאינו מוצ"ש אֵין מברכים על הבשמים ועל הנר)\n',
      'Tלוקח הבשמים בימינו ומברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא עֲצֵי (עִשְׂבֵּי) (מִינֵי) בְשָׂמִים.',
      'Tועל הנר מברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא מְאוֹרֵי הָאֵשׁ.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה',
      ', אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל וּבֵין אוֹר לְחֹשֶׁךְ וּבֵין יִשְׂרָאֵל לָעַמִּים וּבֵין יוֹם הַשְּׁבִיעִי לְשֵׁשֶׁת יְמֵי הַמַּעֲשֶׂה. בָּרוּךְ אַתָּה יְהֹוָה, הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל.'
    ],
  };

  final Map<Nosah, List<String>> brachaEn = {
    Nosah.ashkenaz: const [
      'נוסח אשכנז',
      'Bנוטל הכוס בידו ואומר:',
      'הִנֵּה אֵל יְשׁוּעָתִי אֶבְטַח וְלֹא אֶפְחָד. כִּי עָזִּי וְזִמְרָת יָהּ יְהֹוָה וַיְהִי לִי לִישׁוּעָה. וּשְׁאַבְתֶּם מַיִם בְּשָׂשׁוֹן מִמַּעַיְנֵי הַיְשׁוּעָה. לַיהֹוָה הַיְשׁוּעָה עַל עַמְּךָ בִרְכָתֶךָ סֶּלָה. יְהֹוָה צְבָאוֹת עִמָּנוּ מִשְׂגָּב לָנוּ אֱלֹהֵי יַעֲקֹב סֶלָה. יְהֹוָה צְבָאוֹת אַשְׁרֵי אָדָם בֹּטֵחַ בָּךְ. יְהֹוָה הוֹשִׁיעָה הַמֶּלֶךְ יַעֲנֵנוּ בְּיוֹם קָרְאֵנוּ. לַיְּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה וְשָׂשׁוֹן וִיקָר. כֵּן תִּהְיֶה לָנוּ: כּוֹס יְשׁוּעוֹת אֶשָּׂא. וּבְשֵׁם יְהֹוָה אֶקְרָא.',
      'סַבְרִי מָרָנָן וְרַבָּנָן וְרַבּוֹתַי:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא פְּרִי הַגָּפֶן.',
      'Tלוקח הבשמים בימינו ומברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא מִינֵי בְשָׂמִים.',
      'Tועל הנר מברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. בּוֹרֵא מְאוֹרֵי הָאֵשׁ.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה',
      ', אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל. בֵּין אוֹר לְחשֶׁךְ. בֵּין יִשְׂרָאֵל לָעַמִּים. בֵּין יוֹם הַשְּׁבִיעִי לְשֵׁשֶׁת יְמֵי הַמַּעֲשֶׂה: בָּרוּךְ אַתָּה יְהֹוָה. הַמַבְדִּיל בֵּין קֹדֶשׁ לְחוֹל.'
    ],
    Nosah.mizrah: const [
      'נוסח מזרח',
      'רִאשׁוֹן לְצִיּוֹן הִנֵּה הִנָּם, וְלִירוּשָׁלַיִם מְבַשֵּׂר אֶתֵּן. אַל תִּשְׂמְחִי אוֹיַבְתִּי לִי כִּי נָפַלְתִּי קַמְתִּי, כִּי אֵשֵׁב בַּחוֹשֶׁךְ יְהֹוָה אוֹר לִי. לַיּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה, וְשָׂשֹׂן וִיקָר. וַיְהִי דָוִד לְכָל דְּרָכָיו מַשְׂכִּיל וַיהֹוָה עִמּוֹ. וְנֹחַ מָצָא חֵן בְּעֵינֵי יְהֹוָה כֵּן נִמְצָא חֵן וְשֵׂכֶל טוֹב בְּעֵינֵי אֱלֹהִים וְאָדָם. קוּמִי אוֹרִי כִּי בָא אוֹרֵךְ, וּכְבוֹד יְהֹוָה עָלַיִךְ זָרַח. כִּי הִנֵּה הַחֹשֶׁךְ יְכַסֶּה אֶרֶץ וַעֲרָפֶל לְאֻמִּים, וְעָלַיִךְ יִזְרַח יְהֹוָה וּכְבוֹדוֹ עָלַיִךְ יֵרָאֶה.',
      'Tויקח הכוס בידו ויאמר:',
      'Sכּוֹס ישׁוּעוֹת אֶשָּׂא, וּבְשֵׁם יְהֹוָה אֶקְרָא.',
      'אָנָּא יְהֹוָה הוֹשִׁיעָה נָּא (שתי פעמים).',
      'אָנָּא יְהֹוָה הַצְלִיחָה נָא (שתי פעמים).',
      'הַצְלִיחֵנוּ, הַצְלַח דּרָכֵינוּ, הַצְלַח לִמּוּדֵינוּ, וּשְׁלַח בְּרָכָה רְוָחָה וְהַצְלָחָה בְּכָל מַעֲשֵׂה יָדֵינוּ, כְּדִכְתִיב יִשָּׂא בְרָכָה מֵאֵת יְהֹוָה וּצְדָקָה מֵאֱלֹהֵי יִשְׁעוֹ. לַיּהוּדִים הָיְתָה אוֹרָה וְשִׂמְחָה, וְשָׂשֹׂן וִיקָר. וּכְתִיב וַיְהִי דָוִד לְכָל דְּרָכָיו מַשְׂכִּיל, וַיהֹוָה עִמּוֹ. כֵּן יִהְיֶה עִמָּנוּ תָמִיד.',
      'Sסַבְרֵי מָרָנָן. (ועונים:) לחַיִּים.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגֶּפֶן.',
      'T(במוצאי יו"ט שאינו מוצ"ש אֵין מברכים על הבשמים ועל הנר)\n',
      'Tלוקח הבשמים בימינו ומברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא עֲצֵי (עִשְׂבֵּי) (מִינֵי) בְשָׂמִים.',
      'Tועל הנר מברך:',
      'Sבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא מְאוֹרֵי הָאֵשׁ.',
      'Sבָּרוּךְ אַתָּה יְהֹוָה',
      ', אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל וּבֵין אוֹר לְחֹשֶׁךְ וּבֵין יִשְׂרָאֵל לָעַמִּים וּבֵין יוֹם הַשְּׁבִיעִי לְשֵׁשֶׁת יְמֵי הַמַּעֲשֶׂה. בָּרוּךְ אַתָּה יְהֹוָה, הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל.'
    ],
  };
}
