import 'package:flutter/material.dart';
import 'package:kodesh_app/providers/tfilot.dart';
import 'package:kodesh_app/widgets/custom_app_bar.dart';
import 'package:flutter_gen/gen_l10n/app_localizations.dart';
import 'package:kodesh_app/widgets/tefila_widget.dart';

class SfiratOmerScreen extends StatelessWidget {
  SfiratOmerScreen({super.key});
  static String routeName = '/sfirat_omer_screen';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar:
            CustomAppBar(title: AppLocalizations.of(context)!.sederSfiratOmer),
        body: TefilaWidget(
          getBracha: getBracha,
          // isWithNosah: false,
          // imagePath: 'assets/nerot_shabat.jpg',
          // imageExtaLine:
          //      '* לאחר הדלקת הנרות עוצמת האשה את עיניה או מכסה אותן בידיה, מברכת ושוב מסתכלת בנרות.\n',
        ));
  }

  late final Map<String, Map<Nosah, List<String>>> getBracha = {
    'he': brachaHeb,
    'en': brachaEn,
  };

  final Map<Nosah, List<String>> brachaHeb = {
    Nosah.ashkenaz: const [
      // Nosah.sfara
      'נוסח ספרד',
      'לְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ, בִּדְחִילוּ וּרְחִימוּ, לְיַחֲד שֵׁם י"ה בו"ה בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. הִנְנִי מוּכָן וּמְזֻמָּן לְקַיֵּם מִצְוַת עֲשֵׂה שֶׁל סְפִירַת הָעֹמֶר כְּמוֹ שֶׁכָּתוּב בַּתּוֹרָה: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה: עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיְיָ: וִִיהִי נֹעַם יְיָ אֱלֹהֵינוּ עָלֵינוּ ומַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ:',
      'Sבָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר.',
      'Sלַמְנַצֵּחַ בִּנְגִינוֹת מִזְמוֹר שִׁיר',
      ': אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ, יָאֵר פָּנָיו אִתָּנוּ, סֶלָה: לָדַעַת בָּאָרֶץ דַרְכֶּךָ, בְּכָל גּוֹיִם יְשׁוּעָתֶךָ: יוֹדוּךָ עַמִּים אֱלֹהִים, יוֹדוּךָ עַמִּים כֻּלָּם: יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים, כִּי תִשְׁפֹּט עַמִּים מִישֹׁר, וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה: יוֹדוּךָ עַמִּים אֱלֹהִים, יוֹדוּךָ עַמִּים כֻּלָּם: אֶרֶץ נָתְנָה יְבוּלָהּ, יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ: יְבָרְכֵנוּ אֱלֹהִים, וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ:',
      'Sאָנָּא בְּכֹחַ',
      ', גְּדֻלַּת יְמִינֶךָ, תַּתִּיר צְרוּרָה.',
      'קַבֵּל רִנַּת, עַמֶּךָ. שַׂגְּבֵנוּ, טַהֲרֵנוּ נוֹרָא.',
      'נָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדֶךָ, כְּבָבַת שָׁמְרֵם.',
      'בָּרְכֵם טַהֲרֵם, רַחֲמֵי צִדְקָתֶךָ, תָּמִיד גָּמְלֵם.',
      'חָסִין קָדוֹשׁ, בְּרֹב טוּבְךָ, נַהֵל עֲדָתֶךָ.',
      'יָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶךָ.',
      'Sבָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד:',
      'Sרִבּוֹנוֹ שֶׁל עוֹלָם',
      ', אַתָּה צִוִּיתָנוּ עַל יְדֵי מֹשֶׁה עַבְדֶּךָ לִסְפּוֹר סְפִירַת הָעוֹמֶר, כְּדֵי לְטַהֲרֵנוּ מִקְּלִפּוֹתֵינוּ וּמִטֻּמְאוֹתֵינוּ, כְּמוֹ שֶׁכָּתַבְתָּ בְּתוֹרָתֶךָ. וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת־עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה. עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם. כְּדֵי שֶׁיּטָּהֲרוּ נַפְשׁוֹת עַמְּךָ יִשְׂרָאֵל מִזֻּהֲמָתָם. וְּבְכֵן יְהִי רָצוֹן מִלְּפָנֶיךָ יְיָ אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁבִּזְכוּת סְפִירַת הָעוֹמֶר שֶׁסָּפַרְתִּי הַיּוֹם, יְתֻקַּן מַה שֶׁפָּגַמְתִּי בִּסְפִירָה וְאֶטָּהֵר וְאֶתְקַדֵּשׁ בִּקְדֻשָּׁה שֶׁל מַעְלָה, וַעל יְדֵי זֶה יֻשְׁפַּע שֶׁפַע רַב בְּכָל הָעוֹלָמוֹת. וּלְתַקֵּן אֶת נַפְשׁוֹתֵינוּ, וְרוּחוֹתֵינוּ, וְנִשְׁמוֹתֵינוּ, מִכָּל סִיג וּפְגַם, וּלְטַהֲרֵנוּ וּלְקַדְּשֵׁנוּ בִּקְדֻשָּׁתְךָ הָעֶלְיוֹנָה, אָמֵן סֶלָה.'
    ],
    Nosah.mizrah: const [
      'נוסח מזרח',
      'Sלְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ',
      ', בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא שֵׁם יוֹ"ד קֵ"י בְּוָא"ו קֵ"י בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. וּבְשֵׁם כָּל הַנְּפָשׁוֹת וְהָרוּחוֹת וְהַנְּשָׁמוֹת הַמִּתְיַחֲסִים אְל שָׁרְשֵׁי נַפְשֵׁנוּ וְרוּחֵנוּ וְנִשְׁמָתֵנוּ וּמַלְבּוּשֵׁיהֶם וְהַקְּרוֹבִים לָהֶם שֶׁמִּכְּלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה וּמִכָּל פְּרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה וּמִכָּל פְּרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה דְכָל פַּרְצוּף וּסְפִירָה דִפְרָטֵי אֲצִילוּת, בְּרִיאָה, יצִירָה, עֲשִׂיָּה. הֲרֵינִי מוּכָן וּמְזֻמָּן לְקַיֵּם מִצְוַת סְפִירַת הָעֹמֶר לִסְפֹּר יָמִים וְשָׁבוּעוֹת כַּאֲשֶׁר צִוָּנוּ יְהֹוָה אֱלֹהֵינוּ בְּתוֹרָתוֹ הַקְּדוֹשָׁה (בְּלֵיל מ"ט לָעֹמֶר יְדַלֵּג הַפְּסוּקִים הָאֵלֶּה וְיֹאמַר לַעֲשׂוֹת נַחַת רוּחַ וְכוּ\') "וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהֹוָה". וְנֶאֱמַר "שִׁבְעָה שָׁבֻעֹת תִּסְפָּר לָךְ, מֵהָחֵל חֶרְמֵשׁ בַּקָּמָה תָּחֵל לִסְפֹּר שִׁבְעָה שָׁבֻעוֹת". לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצרֵנוּ וְלַעֲשׂוֹת רְצוֹן בּוֹרְאֵנוּ אֲשֶׁר קִדְּשָׁנוּ בְמִצְוֹתָיו וְצִוָּנוּ בְּמִצְוָה זוֹ לְתַקֵּן שֹׁרֶשׁ מִצְוָה זוֹ בְּמָקוֹם עֶלְיוֹן בִּשִׁעוּר קוֹמָה לְהַשְׁלִים אִילָן הָעֶלְיוֹן וּלְהַשְׁלִים אָדָם הָעֶלְיוֹן וּלְהָקִים אֶת סֻכַּת דָּוִד לְהַחֲזִיר עֲטָרָה לְיָשְׁנָהּ, לְבָרֵר וּלְתַקֵּן וּלְהַעֲלוֹת כָּל הַנְּפָשׁוֹת וְהָרוּחוֹת וְהַנְּשָׁמוֹת וְנִיצוֹצֵי הַקְּדֻשָּׁה שֶׁנָּפְלוּ בַּקְּלִפָּה עַל יְדֵי אָדָם הָרִאשׁוֹן וְעַל יָדֵינוּ בְּגִלְגּוּלִים אֵלּוּ וּבְגִלְגּוּלִים אֲחֵרִים וּשְׁאֵרִית הָרפ"ח נִיצוֹצִין וּלְהַשְׁלִים שְׁלֵמוּת תִּקּוּן נַפְשֵׁנוּ רוּחֵנוּ וְנִשְׁמָתֵנוּ שֶׁמִּכְּלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה דְכָל פַּרְצוּף וּסְפִירָה דִפְרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה הַמִּתְיַחֲסִים אֶל תִּקּוּן מִצְוָה זוֹ, וְגַם לְהַשְׁלִים שְׁלֵמוּת תִּקּוּן אֵיברֵי נֶפֶשׁ רוּחַ וּנְשָׁמָה דְכָל יִשְׂרָאֵל הַחַיִּים וְהַמֵּתִים הַחֲסֵרִים מִתִּקּוּן מִצְוָה זוֹ וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁיִּהְיֶה עַתָּה עֵת רָצוֹן לְפָנֶיךָ לִהְיוֹת עוֹלָה מִצְוָה זוֹ לְתַקֵּן אֶת כָּל פְּגָמֵינוּ וּפְגָמֵי אָדָם הָרִאשׁוֹן אֲשֶׁר פָּגַמְנוּ בִּכְלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וּבְכָל צַלְמֵי לְבוּשֵׁי נֶפֶשׁ רוּחַ נְשָׁמָה חַיָּה יְחִידָה דַּאֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וּלְצָרֵף וּלבָרֵר וּלְהָסִיר חֶלְקֵי הַנֶּפֶשׁ שֶׁנִּפְגְּמוּ וְנָפְלוּ בְּנֹגַהּ דַאֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וְנֹגַהּ כָּאוֹר תִּהְיֶה אֶל מְקוֹם הַקֹּדֶשׁ אָנָּא יְהֹוָה הַפְרֵד נָא מֵעָלֵינוּ צַד הָרַע שֶׁבַּיֵּצֶר הָרָע וּתְזַכְּכֵנוּ וּתְלַבְּבֵנוּ בְּכֹחַ הַיֵּצֶר הַטּוֹב, וְיִתְיַחֲדוּ אַרְבַּע אוֹתִיוֹת הַשֵּׁם בָּרוּךְ הוּא בְּיִחוּדָא שְׁלִים וְיִהְיוּ כִּסֵּא שָׁלֵם אֲשֶׁר בָּהֶם יִתְפַּשֵּׁט שֶׁפַע אֵין סוֹף וְיִתְיַחֲדוּ אַבָּא וְאִמָּא בְּיִחוּדָא שְׁלִים (יאההויה"ה) וְיִזְדַוְּגוּ (זו"ן) תִּפְאֶרֶת וּמַלְכוּת זִוּוּגָא שְׁלִים בְּשֵׁם (יאהדונה"י) וּמִשָּׁם יִמָּשֵׁךְ שֶׁפַע וּבְרָכָה בְּכָל הָעוֹלָמוֹת לְזַכֵּךְ נַפְשֵׁנוּ רוּחֵנוּ וְנִשְׁמָתֵנוּ שֶׁיִּהְיוּ רְאוּיִים לְעוֹרֵר מַיִּין נוּקְבִין וּלְהַמְשִׁיךְ מַיִּין דְּכוּרִין, וְאַל יְעַכֵּב שׁוּם חֵטְא וְעָוֹן וְהִרְהוּר רַע אֶת הַמִּצְוָה הַזֹּאת וְתַעֲלְה לְרָצוֹן לְרֵיחַ לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁבְּכֹחַ מִצְוַת הַסְּפִירָה הַזֹּאת יְתֻקַּן מַה שֶּׁפָּגַמְתִּי בִּסְפִירַת זו"ן שֶׁהֵם תִּפאֶרֶת וּמַלְכוּת שֶׁל הַלַּילָה הַזֶּה. וִיהִי רָצוֹן מִלְּפָנֶיךָ שֶׁיִּהְיֶה חָשׁוּב וּמְקֻבָּל וּמְרֻצֶּה לְפָנֶיךָ הֶבֶל הַיּוֹצֵא מִפִּינוּ בַּבְּרָכָה וְהַסְּפִירָה שֶׁל הָעֹמֶר לְהַמְשִׁיךְ אוֹר מַקִּיף בַּמָּקוֹם הָרָאוּי כִּרְצוֹנֶךָ, וְיִהְיֶה חָשׁוּב וּמְקֻבָּל וּמְרֻצֶּה שִׂיחַ שִׂפְתוֹתֵינוּ בְּבַקָּשָׁתֵנוּ עַל חֲזָרַת עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ לְתַקֵּן בְּאוֹר פְּנִימִי כִּרְצוֹנֶךָ. וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ. (ב\' פעמים)',
      'S\n\nלְשֵׁם יִחוּד קֻדְשָׁא בְרִיךְ הוּא וּשְׁכִינְתֵּיהּ',
      ', בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא שֵׁם יוֹ"ד קֵ"י בְּוָא"ו קֵ"י בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. הִנֵּה אֲנַחְנוּ בָּאִים לְקַיֵּם מִצְוַת סְפִירַת הָעֹמֶר, כְּדִכְתִיב: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה: עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהֹוָה: לְתַקֵּן אֶת שָׁרְשָׁהּ בְּמָקוֹם עֶלְיוֹן. לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצְרֵנוּ. וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ. יְהֹוָה יִגְמֹר בַּעֲדִי, יְהֹוָה חַסְדְּךָ לְעוֹלָם, מַעֲשֵׂי יָדֶיךָ אַל תֶּרֶף אֶקְרָא לֵאלֹהִים עֶלְיוֹן, לָאֵל גֹּמֵר עָלָי וָאֶעֱבֹר עָלַיִךְ וָאֶרְאֵךְ מִתְבּוֹסֶסֶת בְּדָמָיִךְ. וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי. בָּרְכִי נַפְשִׁי אֶת יְהֹוָה. יְהֹוָה אֱלֹהַי גָּדַלְתָּ מְּאֹד. הוֹד וְהָדָר לָבָשְׁתָּ עֹטֶה אוֹר כַּשַּׂלְמָה. נוֹטֶה שָׁמַיִם כַּיְרִיעָה.',
      'S\nבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר.',
      'Sהָרַחֲמָן',
      ' הוּא יַחֲזִיר עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ בִּמְהֵרָה בְיָמֵינוּ אָמֵן.',
      'Sלַמְנַצֵּחַ',
      ' בִּנְגִינֹת מִזְמוֹר שִׁיר אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ. יָאֵר פָּנָיו אִתָּנוּ סֶלָה לָדַעַת בָּאָרֶץ דַּרְכֶּךָ. בְּכָל גּוֹיִם יְשׁוּעָתֶךָ. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים. כִּי תִשְׁפֹּט עַמִּים מִישֹׁר. וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. אֶרֶץ נָתְנָה יְבוּלָהּ. יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ. יְבָרְכֵנוּ אֱלֹהִים. וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ.',
      'S\nאָנָּא בְּכֹחַ',
      ', גְּדֻלַּת יְמִינֶךָ, תַּתִּיר צְרוּרָה.',
      'קַבֵּל רִנַּת, עַמֶּךָ. שַׂגְּבֵנוּ, טַהֲרֵנוּ נוֹרָא.',
      'נָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדֶךָ, כְּבָבַת שָׁמְרֵם.',
      'בָּרְכֵם טַהֲרֵם, רַחֲמֵי צִדְקָתֶךָ, תָּמִיד גָּמְלֵם.',
      'חָסִין קָדוֹשׁ, בְּרֹב טוּבְךָ, נַהֵל עֲדָתֶךָ.',
      'יָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶךָ.',
      'שַׁוְעָתֵנוּ קַבֵּל, וּשְׁמַע צַעֲקָתֵנוּ, יוֹדֵעַ תַּעֲלוּמוֹת.',
      'Sואומר בלחש - בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד.',
    ],
  };

  final Map<Nosah, List<String>> brachaEn = {
    Nosah.ashkenaz: const [
      // Nosah.sfara
      'נוסח ספרד',
      'לְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ, בִּדְחִילוּ וּרְחִימוּ, לְיַחֲד שֵׁם י"ה בו"ה בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. הִנְנִי מוּכָן וּמְזֻמָּן לְקַיֵּם מִצְוַת עֲשֵׂה שֶׁל סְפִירַת הָעֹמֶר כְּמוֹ שֶׁכָּתוּב בַּתּוֹרָה: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה: עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיְיָ: וִִיהִי נֹעַם יְיָ אֱלֹהֵינוּ עָלֵינוּ ומַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ:',
      'Sבָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר.',
      'Sלַמְנַצֵּחַ בִּנְגִינוֹת מִזְמוֹר שִׁיר',
      ': אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ, יָאֵר פָּנָיו אִתָּנוּ, סֶלָה: לָדַעַת בָּאָרֶץ דַרְכֶּךָ, בְּכָל גּוֹיִם יְשׁוּעָתֶךָ: יוֹדוּךָ עַמִּים אֱלֹהִים, יוֹדוּךָ עַמִּים כֻּלָּם: יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים, כִּי תִשְׁפֹּט עַמִּים מִישֹׁר, וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה: יוֹדוּךָ עַמִּים אֱלֹהִים, יוֹדוּךָ עַמִּים כֻּלָּם: אֶרֶץ נָתְנָה יְבוּלָהּ, יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ: יְבָרְכֵנוּ אֱלֹהִים, וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ:',
      'Sאָנָּא בְּכֹחַ',
      ', גְּדֻלַּת יְמִינֶךָ, תַּתִּיר צְרוּרָה.',
      'קַבֵּל רִנַּת, עַמֶּךָ. שַׂגְּבֵנוּ, טַהֲרֵנוּ נוֹרָא.',
      'נָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדֶךָ, כְּבָבַת שָׁמְרֵם.',
      'בָּרְכֵם טַהֲרֵם, רַחֲמֵי צִדְקָתֶךָ, תָּמִיד גָּמְלֵם.',
      'חָסִין קָדוֹשׁ, בְּרֹב טוּבְךָ, נַהֵל עֲדָתֶךָ.',
      'יָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶךָ.',
      'Sבָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד:',
      'Sרִבּוֹנוֹ שֶׁל עוֹלָם',
      ', אַתָּה צִוִּיתָנוּ עַל יְדֵי מֹשֶׁה עַבְדֶּךָ לִסְפּוֹר סְפִירַת הָעוֹמֶר, כְּדֵי לְטַהֲרֵנוּ מִקְּלִפּוֹתֵינוּ וּמִטֻּמְאוֹתֵינוּ, כְּמוֹ שֶׁכָּתַבְתָּ בְּתוֹרָתֶךָ. וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת־עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה. עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם. כְּדֵי שֶׁיּטָּהֲרוּ נַפְשׁוֹת עַמְּךָ יִשְׂרָאֵל מִזֻּהֲמָתָם. וְּבְכֵן יְהִי רָצוֹן מִלְּפָנֶיךָ יְיָ אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁבִּזְכוּת סְפִירַת הָעוֹמֶר שֶׁסָּפַרְתִּי הַיּוֹם, יְתֻקַּן מַה שֶׁפָּגַמְתִּי בִּסְפִירָה וְאֶטָּהֵר וְאֶתְקַדֵּשׁ בִּקְדֻשָּׁה שֶׁל מַעְלָה, וַעל יְדֵי זֶה יֻשְׁפַּע שֶׁפַע רַב בְּכָל הָעוֹלָמוֹת. וּלְתַקֵּן אֶת נַפְשׁוֹתֵינוּ, וְרוּחוֹתֵינוּ, וְנִשְׁמוֹתֵינוּ, מִכָּל סִיג וּפְגַם, וּלְטַהֲרֵנוּ וּלְקַדְּשֵׁנוּ בִּקְדֻשָּׁתְךָ הָעֶלְיוֹנָה, אָמֵן סֶלָה.'
    ],
    Nosah.mizrah: const [
      'נוסח מזרח',
      'Sלְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ',
      ', בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא שֵׁם יוֹ"ד קֵ"י בְּוָא"ו קֵ"י בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. וּבְשֵׁם כָּל הַנְּפָשׁוֹת וְהָרוּחוֹת וְהַנְּשָׁמוֹת הַמִּתְיַחֲסִים אְל שָׁרְשֵׁי נַפְשֵׁנוּ וְרוּחֵנוּ וְנִשְׁמָתֵנוּ וּמַלְבּוּשֵׁיהֶם וְהַקְּרוֹבִים לָהֶם שֶׁמִּכְּלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה וּמִכָּל פְּרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה וּמִכָּל פְּרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה דְכָל פַּרְצוּף וּסְפִירָה דִפְרָטֵי אֲצִילוּת, בְּרִיאָה, יצִירָה, עֲשִׂיָּה. הֲרֵינִי מוּכָן וּמְזֻמָּן לְקַיֵּם מִצְוַת סְפִירַת הָעֹמֶר לִסְפֹּר יָמִים וְשָׁבוּעוֹת כַּאֲשֶׁר צִוָּנוּ יְהֹוָה אֱלֹהֵינוּ בְּתוֹרָתוֹ הַקְּדוֹשָׁה (בְּלֵיל מ"ט לָעֹמֶר יְדַלֵּג הַפְּסוּקִים הָאֵלֶּה וְיֹאמַר לַעֲשׂוֹת נַחַת רוּחַ וְכוּ\') "וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהֹוָה". וְנֶאֱמַר "שִׁבְעָה שָׁבֻעֹת תִּסְפָּר לָךְ, מֵהָחֵל חֶרְמֵשׁ בַּקָּמָה תָּחֵל לִסְפֹּר שִׁבְעָה שָׁבֻעוֹת". לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצרֵנוּ וְלַעֲשׂוֹת רְצוֹן בּוֹרְאֵנוּ אֲשֶׁר קִדְּשָׁנוּ בְמִצְוֹתָיו וְצִוָּנוּ בְּמִצְוָה זוֹ לְתַקֵּן שֹׁרֶשׁ מִצְוָה זוֹ בְּמָקוֹם עֶלְיוֹן בִּשִׁעוּר קוֹמָה לְהַשְׁלִים אִילָן הָעֶלְיוֹן וּלְהַשְׁלִים אָדָם הָעֶלְיוֹן וּלְהָקִים אֶת סֻכַּת דָּוִד לְהַחֲזִיר עֲטָרָה לְיָשְׁנָהּ, לְבָרֵר וּלְתַקֵּן וּלְהַעֲלוֹת כָּל הַנְּפָשׁוֹת וְהָרוּחוֹת וְהַנְּשָׁמוֹת וְנִיצוֹצֵי הַקְּדֻשָּׁה שֶׁנָּפְלוּ בַּקְּלִפָּה עַל יְדֵי אָדָם הָרִאשׁוֹן וְעַל יָדֵינוּ בְּגִלְגּוּלִים אֵלּוּ וּבְגִלְגּוּלִים אֲחֵרִים וּשְׁאֵרִית הָרפ"ח נִיצוֹצִין וּלְהַשְׁלִים שְׁלֵמוּת תִּקּוּן נַפְשֵׁנוּ רוּחֵנוּ וְנִשְׁמָתֵנוּ שֶׁמִּכְּלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה דְכָל פַּרְצוּף וּסְפִירָה דִפְרָטֵי אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה הַמִּתְיַחֲסִים אֶל תִּקּוּן מִצְוָה זוֹ, וְגַם לְהַשְׁלִים שְׁלֵמוּת תִּקּוּן אֵיברֵי נֶפֶשׁ רוּחַ וּנְשָׁמָה דְכָל יִשְׂרָאֵל הַחַיִּים וְהַמֵּתִים הַחֲסֵרִים מִתִּקּוּן מִצְוָה זוֹ וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁיִּהְיֶה עַתָּה עֵת רָצוֹן לְפָנֶיךָ לִהְיוֹת עוֹלָה מִצְוָה זוֹ לְתַקֵּן אֶת כָּל פְּגָמֵינוּ וּפְגָמֵי אָדָם הָרִאשׁוֹן אֲשֶׁר פָּגַמְנוּ בִּכְלָלוּת אֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וּבְכָל צַלְמֵי לְבוּשֵׁי נֶפֶשׁ רוּחַ נְשָׁמָה חַיָּה יְחִידָה דַּאֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וּלְצָרֵף וּלבָרֵר וּלְהָסִיר חֶלְקֵי הַנֶּפֶשׁ שֶׁנִּפְגְּמוּ וְנָפְלוּ בְּנֹגַהּ דַאֲצִילוּת, בְּרִיאָה, יְצִירָה, עֲשִׂיָּה, וְנֹגַהּ כָּאוֹר תִּהְיֶה אֶל מְקוֹם הַקֹּדֶשׁ אָנָּא יְהֹוָה הַפְרֵד נָא מֵעָלֵינוּ צַד הָרַע שֶׁבַּיֵּצֶר הָרָע וּתְזַכְּכֵנוּ וּתְלַבְּבֵנוּ בְּכֹחַ הַיֵּצֶר הַטּוֹב, וְיִתְיַחֲדוּ אַרְבַּע אוֹתִיוֹת הַשֵּׁם בָּרוּךְ הוּא בְּיִחוּדָא שְׁלִים וְיִהְיוּ כִּסֵּא שָׁלֵם אֲשֶׁר בָּהֶם יִתְפַּשֵּׁט שֶׁפַע אֵין סוֹף וְיִתְיַחֲדוּ אַבָּא וְאִמָּא בְּיִחוּדָא שְׁלִים (יאההויה"ה) וְיִזְדַוְּגוּ (זו"ן) תִּפְאֶרֶת וּמַלְכוּת זִוּוּגָא שְׁלִים בְּשֵׁם (יאהדונה"י) וּמִשָּׁם יִמָּשֵׁךְ שֶׁפַע וּבְרָכָה בְּכָל הָעוֹלָמוֹת לְזַכֵּךְ נַפְשֵׁנוּ רוּחֵנוּ וְנִשְׁמָתֵנוּ שֶׁיִּהְיוּ רְאוּיִים לְעוֹרֵר מַיִּין נוּקְבִין וּלְהַמְשִׁיךְ מַיִּין דְּכוּרִין, וְאַל יְעַכֵּב שׁוּם חֵטְא וְעָוֹן וְהִרְהוּר רַע אֶת הַמִּצְוָה הַזֹּאת וְתַעֲלְה לְרָצוֹן לְרֵיחַ לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁבְּכֹחַ מִצְוַת הַסְּפִירָה הַזֹּאת יְתֻקַּן מַה שֶּׁפָּגַמְתִּי בִּסְפִירַת זו"ן שֶׁהֵם תִּפאֶרֶת וּמַלְכוּת שֶׁל הַלַּילָה הַזֶּה. וִיהִי רָצוֹן מִלְּפָנֶיךָ שֶׁיִּהְיֶה חָשׁוּב וּמְקֻבָּל וּמְרֻצֶּה לְפָנֶיךָ הֶבֶל הַיּוֹצֵא מִפִּינוּ בַּבְּרָכָה וְהַסְּפִירָה שֶׁל הָעֹמֶר לְהַמְשִׁיךְ אוֹר מַקִּיף בַּמָּקוֹם הָרָאוּי כִּרְצוֹנֶךָ, וְיִהְיֶה חָשׁוּב וּמְקֻבָּל וּמְרֻצֶּה שִׂיחַ שִׂפְתוֹתֵינוּ בְּבַקָּשָׁתֵנוּ עַל חֲזָרַת עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ לְתַקֵּן בְּאוֹר פְּנִימִי כִּרְצוֹנֶךָ. וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ. (ב\' פעמים)',
      'S\n\nלְשֵׁם יִחוּד קֻדְשָׁא בְרִיךְ הוּא וּשְׁכִינְתֵּיהּ',
      ', בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא שֵׁם יוֹ"ד קֵ"י בְּוָא"ו קֵ"י בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל. הִנֵּה אֲנַחְנוּ בָּאִים לְקַיֵּם מִצְוַת סְפִירַת הָעֹמֶר, כְּדִכְתִיב: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה: עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהֹוָה: לְתַקֵּן אֶת שָׁרְשָׁהּ בְּמָקוֹם עֶלְיוֹן. לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצְרֵנוּ. וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ. יְהֹוָה יִגְמֹר בַּעֲדִי, יְהֹוָה חַסְדְּךָ לְעוֹלָם, מַעֲשֵׂי יָדֶיךָ אַל תֶּרֶף אֶקְרָא לֵאלֹהִים עֶלְיוֹן, לָאֵל גֹּמֵר עָלָי וָאֶעֱבֹר עָלַיִךְ וָאֶרְאֵךְ מִתְבּוֹסֶסֶת בְּדָמָיִךְ. וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי. בָּרְכִי נַפְשִׁי אֶת יְהֹוָה. יְהֹוָה אֱלֹהַי גָּדַלְתָּ מְּאֹד. הוֹד וְהָדָר לָבָשְׁתָּ עֹטֶה אוֹר כַּשַּׂלְמָה. נוֹטֶה שָׁמַיִם כַּיְרִיעָה.',
      'S\nבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר.',
      'Sהָרַחֲמָן',
      ' הוּא יַחֲזִיר עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ בִּמְהֵרָה בְיָמֵינוּ אָמֵן.',
      'Sלַמְנַצֵּחַ',
      ' בִּנְגִינֹת מִזְמוֹר שִׁיר אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ. יָאֵר פָּנָיו אִתָּנוּ סֶלָה לָדַעַת בָּאָרֶץ דַּרְכֶּךָ. בְּכָל גּוֹיִם יְשׁוּעָתֶךָ. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים. כִּי תִשְׁפֹּט עַמִּים מִישֹׁר. וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. אֶרֶץ נָתְנָה יְבוּלָהּ. יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ. יְבָרְכֵנוּ אֱלֹהִים. וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ.',
      'S\nאָנָּא בְּכֹחַ',
      ', גְּדֻלַּת יְמִינֶךָ, תַּתִּיר צְרוּרָה.',
      'קַבֵּל רִנַּת, עַמֶּךָ. שַׂגְּבֵנוּ, טַהֲרֵנוּ נוֹרָא.',
      'נָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדֶךָ, כְּבָבַת שָׁמְרֵם.',
      'בָּרְכֵם טַהֲרֵם, רַחֲמֵי צִדְקָתֶךָ, תָּמִיד גָּמְלֵם.',
      'חָסִין קָדוֹשׁ, בְּרֹב טוּבְךָ, נַהֵל עֲדָתֶךָ.',
      'יָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶךָ.',
      'שַׁוְעָתֵנוּ קַבֵּל, וּשְׁמַע צַעֲקָתֵנוּ, יוֹדֵעַ תַּעֲלוּמוֹת.',
      'Sואומר בלחש - בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד.',
    ],
  };
}
