import 'package:flutter/material.dart';
import 'package:kodesh_app/widgets/custom_app_bar.dart';
import 'package:flutter_gen/gen_l10n/app_localizations.dart';

class SederAnahatTefilin extends StatelessWidget {
  const SederAnahatTefilin({super.key});
  static String routeName = '/seder_anahat_tefilin';

  List<Widget> getSederWidgets() {
    const TextStyle boldFont =
        TextStyle(fontWeight: FontWeight.w600, fontSize: 12);
    List<Widget> widgets = [];
    for (int i = 0; i < seder.length; i++) {
      String? text;
      if (seder[i].contains('T')) { // T = title
        text = seder[i].substring(0, seder[i].length - 2);
      }

      widgets.add(text == null
          ? Text(
              seder[i],
              textDirection: TextDirection.rtl,
              textAlign: TextAlign.center,
            )
          : Text(
              text,
              textDirection: TextDirection.rtl,
              style: boldFont,
              textAlign: TextAlign.center,
            ));
    }

    return widgets;
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: AppLocalizations.of(context)!.tefilinOrderMenu),
        body: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.all(8.0),
            child: Column(
              children: getSederWidgets(),
            ),
          ),
        ));
  }

  // ignore: prefer_adjacent_string_concatenation, prefer_interpolation_to_compose_strings
  final List<String> seder = const [
    '\n',
    'מניחים תפילין של יד, ולפני הידוק הרצועה מברכים:\nT',
    'בָּרוּךְ אַתָּה יי, אֱ־לֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו, וְצִוָּנוּ לְהָנִיחַ תְּפִלִּין.\n',
    'מהדקים, וכורכים שבע כריכות על היד.\nT',
    'מניחים תפילין של ראש, ולפני הידוק הרצועה מברכים (למנהג עדות אשכנז בלבד. בני עדות המזרח לא מברכים על תפילין של ראש):\nT',
    'בָּרוּךְ אַתָּה יי, אֱ־לֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו, וְצִוָּנוּ עַל מִצְוַת תְּפִלִּין.\n',
    'מהדקים את התפילין על הראש, ואומרים:\nT',
    'בָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד.\n',
    'יש אומרים אחרי ההנחה:\nT',
    'וּמֵחָכְמָתְךָ אֵ־ל עֶלְיוֹן תַּאֲצִיל עָלַי, וּמִבִּינָתְךָ תְּבִינֵנִי. וּבְחַסְדְּךָ תַּגְדִּיל עָלַי, וּבִגְבוּרָתְךָ תַּצְמִית אוֹיְבַי וְקָמַי. וְשֶׁמֶן הַטּוֹב תָּרִיק עַל שִׁבְעָה קְנֵי הַמְּנוֹרָה, לְהַשְׁפִּיעַ טוּבְךָ לִבְרִיּוֹתֶיךָ. פּוֹתֵחַ אֶת יָדֶךָ וּמַשְׂבִּיעַ לְכָל חַי רָצוֹן.\n',
    '\n',
    'כורכים רצועה של יד סביב האמה, ואומרים:\nT',
    'וְאֵרַשְׂתִּיךְ לִי לְעוֹלָם, וְאֵרַשְׂתִּיךְ לִי בְּצֶדֶק וּבְמִשְׁפָּט וּבְחֶסֶד וּבְרַחֲמִים. וְאֵרַשְׂתִּיךְ לִי בֶּאֱמוּנָה וְיָדַעַתְּ אֶת יי.\n',
    'שְמַע יִשְׁרָאֵל, יי אֱ־לֹהֵינוּ יי אֶחָד.\n',
    'בלחש: בָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד.\n',
    'וְאָהַבְתָּ אֵת יי אֱ־לֹהֶיךָ, בְּכָל לְבָבְךָ וּבְכָל נַפְשְׁךָ וּבְכָל מְאֹדֶךָ. וְהָיוּ הַדְּבָרִים הָאֵלֶּה אֲשֶֹר אָנֹכִי מְצַוְּךָ הַיּוֹם עַל לְבָבֶךָ. וְשׁנַּנְתָּם לְבָנֶיךָ וְדִבַּרְתָּ בָּם, בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ. וּקְשַׁרְתָּם לְאוֹת עַל יָדֶךָ, וְהָיוּ לְטֹטָפֹת בֵּין עֵינֶיךָ. וּכְתַבְתָּם עַל מְזֻזוֹת בֵּיתֶךָ וּבִשְׁעָרֶיךָ.\n',
        'וְהָיָה אִם שָׁמֹעַ תִּשְׁמְעוּ אֶל מִצְוֹתַי אֲשֶׁר אָנֹכִי מְצַוֶּה אֶתְכֶם הַיּוֹם, לְאַהֲבָה אֶת יי אֱ־לֹהֵיכֶם וּלְעָבְדוֹ בְּכָל לְבַבְכֶם וּבְכָל נַפְשְׁכֶם. וְנָתַתִּי מְטַר אַרְצְכֶם בְּעִתּוֹ יוֹרֶה וּמַלְקוֹשׁ, וְאָסַפְתָּ דְגָנֶךָ וְתִירׂשְׁךָ וְיִצְהָרֶךָ. וְנָתַתִּי עֵשֶׂב בְּשָֹדְךָ לִבְהֶמְתֶּךָ, וְאָכַלְתָּ וְשָֹבָעְתָּ. הִשָּׁמְרוּ לָכֶם פֶּן יִפְתֶּה לְבַבְכֶם, וְסַרְתֶּם וַעֲבַדְתֶּם אֱלֹהִים אֲחֵרִים וְהִשְׁתַּחֲוִיתֶם לָהֶם. וְחָרָה אַף יי בָּכֶם וְעָצַר אֶת הַשָּׁמַיִם וְלֹא יִהְיֶה מָטָר וְהָאֲדָמָה לֹא תִתֵּן אֶת יְבוּלָהּ, וַאֲבַדְתֶּם מְהֵרָה מֵעַל הָאָרֶץ הַטֹּבָה אֲשֶׁר יי נֹתֵן לָכֶם. וְשַֹמְתֶּם אֶת דְּבָרַי אֵלֶּה עַל לְבַבְכֶם וְעַל נַפְשְׁכֶם, וּקְשַׁרְתֶּם אֹתָם לְאוֹת עַל יֶדְכֶם וְהָיוּ לְטוֹטָפֹת בֵּין עֵינֵיכֶם. וְלִמַּדְתֶּם אֹתָם אֶת בְּנֵיכֶם לְדַבֵּר בָּם, בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ. וּכְתַבְתָּם עַל מְזוּזוֹת בֵּיתֶךָ וּבִשְׁעָרֶיךָ. לְמַעַן יִרְבּוּ יְמֵיכֶם וִימֵי בְנֵיכֶם עַל הָאֲדָמָה אֲשֶׁר נִשְׁבַּע יי לַאֲבֹתֵיכֶם לָתֵת לָהֶם, כִּימֵי הַשָּׁמַיִם עַל הָאָרֶץ.\n',
    'וַיֹּאמֶר יי אֶל מׂשֶׁה לֵּאמֹר. דַּבֵּר אֶל בְּנֵי יִשְׂרָאֵל וְאָמַרְתָּ אֲלֵהֶם וְעָשׂוּ לָהֶם צִיצִת עַל כַּנְפֵי בִגְדֵיהֶם לְדֹרֹתָם, וְנָתְנוּ עַל צִיצִת הַכָּנָף פְּתִיל תְּכֵלֶת. וְהָיָה לָכֶם לְצִיצִת וּרְאִיתֶם אֹתוֹ וּזְכַרְתֶּם אֶת כָּל מִצְוֹת יי וַעֲשִׂיתֶם אֹתָם, וְלֹא תָתוּרוּ אַחֲרֵי לְבַבְכֶם וְאַחֲרֵי עֵינֵיכֶם אֲשֶׁר אַתֶּם זֹנִים אַחֲרֵיהֶם. לְמַעַן תִּזְכְּרוּ וַעֲשִׂיתֶם אֶת כָּל מִצְוֹתָי וִהְיִיתֶם קְדׂשִׁים לֵא־לֹהֵיכֶם. אֲנִי יי אֱ־לֹהֵיכֶם אֲשֶׁר הוֹצֵאתִי אֶתְכֶם מֵאֶרֶץ מִצְרַיִם לִהְיוֹת לָכֶם לֵא־לֹהִים אֲנִי יי אֱ־לֹהֵיכֶם. אֱמֶת.\n',
    'יש מוספים:\nT',
    'ויְדַבֵּר יְהוָה אֶל מֹשֶׁה לֵּאמֹר: קַדֶּשׁ לִי כָל בְּכוֹר פֶּטֶר כָּל רֶחֶם בִּבְנֵי יִשְׂרָאֵל בָּאָדָם וּבַבְּהֵמָה לִי הוּא: וַיֹּאמֶר מֹשֶׁה אֶל הָעָם זָכוֹר אֶת הַיּוֹם הַזֶּה אֲשֶׁר יְצָאתֶם מִמִּצְרַיִם מִבֵּית עֲבָדִים כִּי בְּחֹזֶק יָד הוֹצִיא יְהֹוָה אֶתְכֶם מִזֶּה וְלֹא יֵאָכֵל חָמֵץ: הַיּוֹם אַתֶּם יֹצְאִים בְּחֹדֶשׁ הָאָבִיב: וְהָיָה כִי יְבִיאֲךָ יְהוָה אֶל אֶרֶץ הַכְּנַעֲנִי וְהַחִתִּי וְהָאֱמֹרִי וְהַחִוִּי וְהַיְבוּסִי אֲשֶׁר נִשְׁבַּע לַאֲבֹתֶיךָ לָתֶת לָךְ אֶרֶץ זָבַת חָלָב וּדְבָשׁ וְעָבַדְתָּ אֶת הָעֲבֹדָה הַזֹּאת בַּחֹדֶשׁ הַזֶּה: שִׁבְעַת יָמִים תֹּאכַל מַצֹּת וּבַיּוֹם הַשְּׁבִיעִי חַג לַיהוָה: מַצּוֹת יֵאָכֵל אֵת שִׁבְעַת הַיָּמִים וְלֹא יֵרָאֶה לְךָ חָמֵץ וְלֹא יֵרָאֶה לְךָ שְׂאֹר בְּכָל גְּבֻלֶךָ: וְהִגַּדְתָּ לְבִנְךָ בַּיּוֹם הַהוּא לֵאמֹר בַּעֲבוּר זֶה עָשָׂה יְהוָה לִי בְּצֵאתִי מִמִּצְרָיִם: וְהָיָה לְךָ לְאוֹת עַל יָדְךָ וּלְזִכָּרוֹן בֵּין עֵינֶיךָ לְמַעַן תִּהְיֶה תּוֹרַת יְהוָה בְּפִיךָ כִּי בְּיָד חֲזָקָה הוֹצִאֲךָ יְהֹוָה מִמִּצְרָיִם: וְשָׁמַרְתָּ אֶת הַחֻקָּה הַזֹּאת לְמוֹעֲדָהּ מִיָּמִים יָמִימָה (שמות י\"ג, א\'-י\').\n',
    'וְהָיָה כִּי יְבִאֲךָ יְהוָה אֶל אֶרֶץ הַכְּנַעֲנִי כַּאֲשֶׁר נִשְׁבַּע לְךָ וְלַאֲבֹתֶיךָ וּנְתָנָהּ לָךְ: וְהַעֲבַרְתָּ כָל פֶּטֶר רֶחֶם לַיהֹוָה וְכָל פֶּטֶר שֶׁגֶר בְּהֵמָה אֲשֶׁר יִהְיֶה לְךָ הַזְּכָרִים לַיהוָה: וְכָל פֶּטֶר חֲמֹר תִּפְדֶּה בְשֶׂה וְאִם לֹא תִפְדֶּה וַעֲרַפְתּוֹ וְכֹל בְּכוֹר אָדָם בְּבָנֶיךָ תִּפְדֶּה: וְהָיָה כִּי יִשְׁאָלְךָ בִנְךָ מָחָר לֵאמֹר מַה זֹּאת וְאָמַרְתָּ אֵלָיו בְּחֹזֶק יָד הוֹצִיאָנוּ יְהוָה מִמִּצְרַיִם מִבֵּית עֲבָדִים: וַיְהִי כִּי הִקְשָׁה פַרְעֹה לְשַׁלְּחֵנוּ וַיַּהֲרֹג יְהֹוָה כָּל בְּכוֹר בְּאֶרֶץ מִצְרַיִם מִבְּכֹר אָדָם וְעַד בְּכוֹר בְּהֵמָה עַל כֵּן אֲנִי זֹבֵחַ לַיהוָה כָּל פֶּטֶר רֶחֶם הַזְּכָרִים וְכָל בְּכוֹר בָּנַי אֶפְדֶּה: וְהָיָה לְאוֹת עַל יָדְכָה וּלְטוֹטָפֹת בֵּין עֵינֶיךָ כִּי בְּחֹזֶק יָד הוֹצִיאָנוּ יְהוָה מִמִּצְרָיִם (שמות י\"ג, י\"א-ט\"ז).',
    '\n'
  ];
}
