Repository: Guyco070/Kodesh-app----Flutter-app
Catalog: lib/api/l10n/app_*.arb
Languages: es, he, ru

# language
source: English
es: español
he: עברית
ru: ру́сский язы́к

source: Main
he: ראשי
ru: главный

source: Menu
es: Menú
he: תפריט
ru: Меню

source: Settings
he: הגדרות

source: Prayers and Blessings
he: תפילות וברכות

source: Aids
he: עזרים

# settingRemindersMenu
source: Setting reminders
es: Configuración de recordatorios
he: קביעת תזכורות
ru: Настройка напоминаний

# candleLightingOrderMenu
source: Shabat candle lighting order
es: Orden de encendido de velas
he: סדר הדלקת נרות
ru: Порядок зажжения свечей

# hanukkahCandleLightingOrderMenu
source: Hanukkah candle lighting
he: סדר הדלקת נרות חנוכה

# sederSfiratOmer
source: Counting of the Omer
he: ברכת ספירת העומר

# tefilinOrderMenu
source: Laying of phylacteries
es: Orden de colocación de filacterias
he: סדר הנחת תפילין
ru: Порядок закладки филактерий

# choresBeforeShabbatMenu
source: Chores before Shabbat
es: Tareas antes de Shabat
he: מטלות לפני שבת
ru: Дела перед Шаббатом

source: Next Week Evants
es: Eventos de la próxima semana
he: אירועי השבוע הקרוב
ru: События следующей недели

# weekEvents
source: Week's events
he: אירועי השבוע
ru: События недели

# todayTimes
source: Today's times
he: זמני היום
ru: Сегодняшнее время

source: Shabat
he: שבת
ru: Шаббат

source: Loading...
es: Cargando...
he: טוען...
ru: Загрузка...

# onlyShabat
source: View only shabat
es: Ver solo shabat
he: הצג רק שבת
ru: Смотреть только Шаббат

# noLaterTimesToShow
source: There are no later times to show for this date.
he: אין זמנים מעכשיו והלאה להצגה עבור תאריך זה
ru: Более поздние времена для этой даты отсутствуют.

source: From now on
he: מעכשיו והלאה
ru: Впредь

source: Current date
es: Fecha actual
he: תאריך נוכחי
ru: Текущая дата

source: Entry and lighting candles
es: Entrada y encendido de velas.
he: כניסה והדלקת נרות
ru: Вход и зажигание свечей

source: Departure and havdalah
es: Salida y havdalá
he: יציאה והבדלה
ru: Отъезд и авдала

source: Event day
es: día del evento
he: תאריך האירוע
ru: День события

source: Start date
es: Fecha de inicio
he: תאריך התחלה
ru: Дата начала

source: End date
es: Fecha final
he: תאריך סיום
ru: Дата окончания

source: Event start date
es: Fecha de inicio del evento
he: תאריך תחילת האירוע
ru: Дата начала мероприятия

source: Event end date
es: Fecha de finalización del evento
he: תאריך סיום האירוע
ru: Дата окончания мероприятия

# parasha
source: Weekly Torah Portion
es: Porción semanal de la Torá
he: פרשת שבוע
ru: Недельная глава Торы

source: Monday
he: שני
ru: Понедельник

source: Tuesday
he: שלישי
ru: Вторник

source: Wednesday
he: רביעי
ru: среда

source: Thursday
he: חמישי
ru: Четверг

source: Friday
he: שישי
ru: пятница

source: Saturday
he: שבת
ru: суббота

source: Sunday
he: ראשון
ru: Воскресенье

source: Today
he: היום
ru: Сегодня

source: Tomorrow
es: Mañana
he: מחר
ru: Завтра

source: Yesterday
es: El dia de ayer
he: אתמול
ru: Вчерашний день

# inXDays
source: In {days} days
es: En {days} días
he: בעוד {days} ימים
ru: Через {days} дней

# xDaysAgo
source: {days} days ago
es: hace {days} días
he: לפני {days} ימים
ru: {days} дней назад

# noIntrnetMessage
source: Sorry, it appears that there is no internet connection, please connect to the internet and press the refresh button.
es: Lo sentimos, parece que no hay conexión a Internet, conéctese a Internet y presione el botón Actualizar.
he: מצטערים, נראה כי אין חיבור לאינטרנט, בבקשה התחבר לאינטרנט ולחץ על כפתור רענון.
ru: Извините, кажется, что нет подключения к Интернету. Пожалуйста, подключитесь к Интернету и нажмите кнопку обновления.

# beforeShabatAndHolidaysSettengs
source: Before shabat and holidays
es: Antes del shabat y festivos
he: לפני שבתות וחגים
ru: Перед Шаббатом и праздниками

source: city
es: ciudad
he: עיר
ru: город

source: minutes
es: minutos
he: דקות
ru: минуты

source: hours
es: horas
he: שעות
ru: часы

# remindMeXhoursAndYMinutesBeforeShbatAndHolidays
source: Remind me {hours} hours and {minutes} minutes before shabat or holiday
es: Recordarme {hours} horas y {minutes} minutos antes del shabat o festivo
he: הזכר לי {hours} שעות ו- {minutes} דקות לפני שבת או חג
ru: Напомнить мне {hours} часов и {minutes} минут до Шаббата или праздника

# remindMeXhoursAndYMinutesBeforeNerotHanukkah
source: Remind me {hours} hours and {minutes} minutes before lighting Hanukkah candles
he: הזכר לי {hours} שעות ו- {minutes} דקות לפני הדלקת נרות חנוכה

# whatToRemindSettings
source: What would you like us to remind you ?
es: ¿Qué te gustaría que te recordáramos?
he: מה תרצה שנזכיר לך ?
ru: Что бы вы хотели, чтобы мы вам напомнили?

# plata
source: Shabbat blech
es: blanqueamiento de Shabat
he: פלטה
ru: Шаббат отбеливать

# plataAction
source: Connect Shabbat blech
es: Conectar blej de Shabat
he: לחבר פלטה
ru: Подключить Шаббат Блеч

# miham
source: Samovar
he: מיחם
ru: Самовар

# mihamAction
source: Connect samovar
es: conectar samovar
he: לחבר מיחם
ru: Подключить самовар

source: Shabbat clock
es: reloj de shabat
he: שעון שבת
ru: Шаббат часы

# shabbatClockAction
source: Turn on Shabbat clock
es: Enciende el reloj de Shabat
he: להפעיל שעון שבת
ru: Включите Шаббат часы

source: Candle lighting
es: encendido de velas
he: הדלקת נרות
ru: Освещение свечей

# candleLightingAction
source: light candles
es: luz de las velas
he: להדליק נרות
ru: לзажечь свечи

source: Air conditioner
es: Aire acondicionado
he: מזגן
ru: Кондиционер

# airConditionerAction
source: Turn on the air conditioner
es: Enciende el aire acondicionado
he: להדליק מזגן
ru: Включите кондиционер

# remindCandleLightningSeperateSettings
source: Remind me to light candles separately
es: Recuérdame encender las velas por separado
he: הזכר לי בנפרד להדליק נרות
ru: Напомни мне зажечь свечи отдельно

# remindMeXhoursAndYMinutesBeforeCandlesLighning
source: Remind me to light candles {hours} hours and {minutes} minutes before shabat or holiday
es: Recuérdame encender las velas {hours} horas y {minutes} minutos antes del shabat o festivo
he: הזכר לי להדליק נרות {hours} שעות ו- {minutes} דקות לפני שבת או חג
ru: Напомни мне зажечь свечи {hours} часа и {minutes} минут до Шаббата или праздника

source: Tefillin
es: Tefilín
he: תפילין
ru: тфилин

# remindTeffilinSettingsAt
source: Remind me to ley on tefillin every day at
es: Recuérdame leer sobre tefilín todos los días a las
he: הזכר לי להניח תפילין כל יום בשעה
ru: Напомните мне возлагать тфилин каждый день в

source: Rosh Hodesh
es: Rosh Jodesh
he: ראש חודש
ru: Рош Ходеш

# remindRoshHodeshSettingsAt
source: Remind me the day before Rosh Chodesh at
es: Recuérdame el día antes de Rosh Jodesh en
he: הזכר לי יום לפני ראש חודש בשעה
ru: Напомни мне за день до Рош Ходеш в

# roshHodeshReminderWillBeAdvanced
source: This reminder will be advanced to weekdays until two o'clock in the afternoon
es: Este recordatorio se adelantará a los días laborables hasta las dos de la tarde.
he: תזכורת זו תוקדם לימי חול עד השעה שתיים בצהריים בשישי
ru: Это напоминание будет перенесено на будние дни до двух часов дня.

# updateRemindersTitle
source: Update reminders
es: Actualizar recordatorios
he: עדכן תזכורות
ru: Обновить напоминания

source: All
es: Todos
he: הכל
ru: Все

source: My
es: Mi
he: שלי
ru: Мой

# noChroesMessage
source: There are no tasks that you asked us to remind you of, this can be changed on the setting reminders page.
es: No hay tareas que nos haya pedido que le recordemos, esto se puede cambiar en la página de configuración de recordatorios.
he: אין מטלות אותן ביקשת שנזכיר לך, ניתן לשנות זאת בעמוד קביעת תזכורות.
ru: Нет задач, о которых вы просили напомнить, это можно изменить на странице настроек напоминаний.

source: Compass
he: מצפן
